# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [102]:
import pandas as pd
import numpy as np

### Step 2. Import the  datasets [cars1.csv](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Merge/Auto_MPG/cars1.csv) and [cars2.csv](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Merge/Auto_MPG/cars2.csv) from the folder

In [103]:
cars1=pd.read_csv('C:\\Users\\disha\\Desktop\\2. Pandas Basic Exercises\\Exercise Data Files\\Pandas Exercise Simple Joins files\\cars1.csv')
cars2=pd.read_csv('C:\\Users\\disha\\Desktop\\2. Pandas Basic Exercises\\Exercise Data Files\\Pandas Exercise Simple Joins files\\cars2.csv')

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [104]:
cars1=pd.read_csv('C:\\Users\\disha\\Desktop\\2. Pandas Basic Exercises\\Exercise Data Files\\Pandas Exercise Simple Joins files\\cars1.csv')
cars2=pd.read_csv('C:\\Users\\disha\\Desktop\\2. Pandas Basic Exercises\\Exercise Data Files\\Pandas Exercise Simple Joins files\\cars2.csv')

### Step 4. It seems our first dataset has some unnamed blank columns, fix cars1

In [105]:
cars1.rename(columns={'Unnamed: 9':'a','Unnamed: 10':'b','Unnamed: 11':'c','Unnamed: 12':'d','Unnamed: 13':'e'},inplace=True)

cars1=cars1.drop(['a','b','c','d','e'],axis=1)
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [133]:
a=pd.Series(cars1.count())
b=pd.Series(cars2.count())
pd.DataFrame([a,b])

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,198,198,198,198,198,198,198,198,198
1,200,200,200,200,200,200,200,200,200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [151]:
cars=cars1.append(cars2)
cars=cars.reset_index()
cars.head()

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. There is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [152]:

rand=np.random.randint(15000,73000,399)
fill=pd.Series(rand)
fill.head()

0    57881
1    27593
2    43913
3    30461
4    15135
dtype: int32

### Step 8. Add the column owners to cars

In [153]:
cars['owners']=fill
cars.head()

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,57881
1,1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,27593
2,2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,43913
3,3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,30461
4,4,17.0,8,302,140,3449,10.5,70,1,ford torino,15135